import math
from sympy.ntheory.factor_ import totient
# a = pow(101, 17, 22663) pow(число, степень, модуль)

# p = 17
# q = 23
# n = p*q  # Модуль
# e = 65537  # экспонента (ну или степень)
# totient_n = totient(n) # Функция Эйлера
# print("phi({}) =  {} ".format(n, totient_n)) # Вывод


# p = 857504083339712752489993810777
# q = 1029224947942998075080348647219
# e = 65537
# n = (p - 1) * (q - 1)
# print(n)

p = 857504083339712752489993810777
q = 1029224947942998075080348647219
e = 65537
phi = (p-1)*(q-1)
d = pow(e, -1, phi)
print(d)


